tap "hashicorp/tap"
tap "nats-io/nats-tools"
tap "seatedro/glimpse"
brew "bat"
brew "bottom"
brew "cmake"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "gnuplot"
brew "pkgconf"
brew "grpcurl"
brew "gstreamer"
brew "htop"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "luarocks"
brew "mpv"
brew "nats-server"
brew "neofetch"
brew "neovim"
brew "node@20"
brew "postgresql@14", link: false
brew "postgresql@16", restart_service: :changed, link: true
brew "pre-commit"
brew "prettier"
brew "protobuf"
brew "pv"
brew "ripgrep"
brew "scc"
brew "shfmt"
brew "sqlfluff"
brew "thefuck"
brew "tmux"
brew "tree"
brew "watch"
brew "websocat"
brew "wget"
brew "wrk"
brew "zig"
brew "zola"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "nats-io/nats-tools/nats"
brew "seatedro/glimpse/glimpse"
cask "1password-cli"
cask "dotnet-sdk"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "kitty"
cask "orbstack"
go "github.com/google/yamlfmt/cmd/yamlfmt"
cargo "cargo-audit"
cargo "cargo-deny"
cargo "cargo-machete"
cargo "cargo-msrv"
cargo "cargo-tarpaulin"
cargo "cargo-udeps"
cargo "cdl"
cargo "reporeport"
cargo "sqlx-cli"
cargo "tansu"
cargo "ulid-cli"
cargo "zoxide"
uv "duckup"
uv "isort"
uv "nbstripout"
uv "pyright"
uv "pytest"
uv "ruff"
uv "ty"
