tap "hashicorp/tap"
tap "seatedro/glimpse"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Command-driven, interactive function plotting
brew "gnuplot"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Like cURL, but for gRPC
brew "grpcurl"
# Development framework for multimedia applications
brew "gstreamer"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@20"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terraform
brew "hashicorp/tap/terraform"
# Blazingly fast tool for peeking at codebases
brew "seatedro/glimpse/glimpse"
# Command-line interface for 1Password
cask "1password-cli"
# Developer platform
cask "dotnet-sdk"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
# Replacement for Docker Desktop
cask "orbstack"
go "github.com/google/yamlfmt/cmd/yamlfmt"
